# Housing Market

### Introduction:

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

### Step 1. Import the necessary libraries

In [65]:
import pandas as pd
import numpy as np

### Step 2. Create 3 differents Series, each of length 100, as follows:

1. The first a random number from 1 to 4
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [66]:
s1 = pd.Series(np.random.randint(1, 4, size=100))
s2 = pd.Series(np.random.randint(1, 3, size=100))
s3 = pd.Series(np.random.randint(10_000, 30_000, size=100))
print(s1, s2, s3)

0     1
1     1
2     2
3     3
4     3
     ..
95    2
96    1
97    3
98    3
99    3
Length: 100, dtype: int32 0     1
1     1
2     2
3     1
4     1
     ..
95    1
96    2
97    1
98    1
99    1
Length: 100, dtype: int32 0     23891
1     10585
2     15987
3     24718
4     10962
      ...
95    29731
96    12670
97    17418
98    26112
99    21898
Length: 100, dtype: int32

### Step 3. Let's create a DataFrame by joinning the Series by column

In [67]:
df = pd.concat([s1, s2, s3], axis=1)

### Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [68]:
# df.rename(columns=["beds", "bathrs", "price_sqr"])
df.columns = ["beds", "bathrs", "price_sqr_meter"]
df.head()

   beds  bathrs  price_sqr_meter
0     1       1            23891
1     1       1            10585
2     2       2            15987
3     3       1            24718
4     3       1            10962

### Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [69]:
df["bigcolumn"] = df.sum(axis=1)
df

    beds  bathrs  price_sqr_meter  bigcolumn
0      1       1            23891      23893
1      1       1            10585      10587
2      2       2            15987      15991
3      3       1            24718      24722
4      3       1            10962      10966
..   ...     ...              ...        ...
95     2       1            29731      29734
96     1       2            12670      12673
97     3       1            17418      17422
98     3       1            26112      26116
99     3       1            21898      21902

[100 rows x 4 columns]

### Step 6. Oops, it seems it is going only until index 99. Is it true?

In [70]:
len(df)

100

### Step 7. Reindex the DataFrame so it goes from 0 to 299

In [72]:
bigcolumn = pd.concat([s1, s2, s3], axis=0)
bigcolumn = bigcolumn.to_frame()

bigcolumn.reset_index()
bigcolumn.index = pd.RangeIndex(start=0, stop=len(bigcolumn))

bigcolumn

         0
0        1
1        1
2        2
3        3
4        3
..     ...
295  29731
296  12670
297  17418
298  26112
299  21898

[300 rows x 1 columns]